## Concat and Append

In [1]:
import numpy as np
import pandas as pd

In [3]:
print("concatenation of numpy array")
x=[[1,2],
   [3,4]]
np.concatenate([x,x],axis=1)

concatenation of numpy array

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [9]:
ser1=pd.Series(['A','B','C'])
ser2=pd.Series(['D','E','F'])
pd.concat([ser1,ser2],ignore_index=True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [10]:
#higher dimentional object : DataFrame

In [22]:
def make_df(col,ind):
    # Quickly make a DataFrame
    data={c:[str(c) + str(i) for i in ind]
                             for c in col}
    print(data)
    return pd.DataFrame(data,ind)

In [23]:
make_df('ABC',range(3))

{'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2'], 'C': ['C0', 'C1', 'C2']}

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [24]:
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
print(df1)
print(df2)
pd.concat([df1,df2])

{'A': ['A1', 'A2'], 'B': ['B1', 'B2']}
{'A': ['A3', 'A4'], 'B': ['B3', 'B4']}
    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [28]:
df3=make_df('ABC',[1,2])
df4=make_df('BCD',[3,4])
pd.concat([df3,df4])

{'A': ['A1', 'A2'], 'B': ['B1', 'B2'], 'C': ['C1', 'C2']}
{'B': ['B3', 'B4'], 'C': ['C3', 'C4'], 'D': ['D3', 'D4']}

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [29]:
pd.concat([df3,df4],join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [30]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## Merge and Join

In [3]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']}) 
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [34]:
df3=pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [1]:
# one to one
# many to one
# one to many
# many to many

In [9]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## left_on and right_on keyword

In [11]:
df3=pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'] ,
                'salary':[70000,80000,120000,90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [14]:
pd.merge(df1,df3,left_on='employee',right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [15]:
#drop the redundent column
print(df1)
print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [21]:
pd.merge(df1,df3,right_index=True,left_index=True).drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [22]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [25]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a)
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [28]:
# DataFrames implement the join() method, 
# which performs a merge that defaults to joining on indices
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

## Specifying set arithmetic for join
This comes up when a value appears in one key column but not the other

In [34]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                     'food': ['fish', 'beans', 'bread']},
                    columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
print(df6);
print(df7);

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer

In [35]:
print(pd.merge(df6, df7)) # name is common column

   name   food drink
0  Mary  bread  wine

In [37]:
pd.merge(df6,df7,how='inner') # by default : inner

   name   food drink
0  Mary  bread  wine

In [39]:
pd.merge(df6,df7,how='outer') # common in name , NaN for not match

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [40]:
pd.merge(df6,df7,how='left') # left outer join

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

## Overlapping column names : the suffix keyword

In [42]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [43]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'rank': [3, 1, 4, 2]})
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [46]:
# name in common and values are same
# rank is common column but different value 
# so ,rank is marked as rank_x ,rank_y
pd.merge(df8,df9,on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [47]:
# Use the custom suffixes keyword
pd.merge(df8,df9,on='name',suffixes=['_L','_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2